
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTI.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC 9 VALUE 10.
       01 B PIC 9 VALUE 2.
       01 C PIC 9.

       PROCEDURE DIVISION.
           MULTIPLY A BY B GIVING C
           DISPLAY "A * B = " C
           GOBACK.
